Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_barcode_flow/SUI_docs_tbl_barcode_flow.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_barcode_flow</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_goods_delta/SUI_docs_tbl_goods_delta.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_goods_delta</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>d_qtty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_cell</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_price</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>use_series</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТаблицы</name>
    <type>
      <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/CommonModules/SUI_ДокументыОбменаВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура УдалитьДанныеДокументовОбмена(ДокументыОбмена) Экспорт
	SUI_ДокументыОбмена.УдалитьДокументыОбмена(ДокументыОбмена);
КонецПроцедуры	

Функция ДанныеДокументаОбменаКЗагрузкеВДокумент(ПараметрыОперации, ИдентификаторФормы) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ДанныеДокументаОбменаКЗагрузкеВДокумент", 
		ПараметрыОперации, ПараметрыВыполнения);
		
КонецФункции

Функция ДанныеДокументаДополнительные(ПараметрыОперации, ИдентификаторФормы) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ДанныеДокументаДополнительные", 
		ПараметрыОперации, ПараметрыВыполнения);
		
КонецФункции

Функция ДокументОбменаСодержитДанныеПотокаШтрихкодов(ДокументСсылка, НастройкаДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура("ЭтоДокументСборШК,ЕстьПотокШК", Ложь, Истина);
	
	Если ДокументСсылка.Метаданные() = Метаданные.Документы.SUI_СборШтрихкодов Тогда
		Результат.ЭтоДокументСборШК = Истина;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(SUI_docs_tbl_barcode_flow.sid) > 0 КАК ЕстьПотокШК
			|ИЗ
			|	РегистрСведений.SUI_docs КАК SUI_docs
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcode_flow КАК SUI_docs_tbl_barcode_flow
			|		ПО SUI_docs.sid = SUI_docs_tbl_barcode_flow.sid_doc
			|ГДЕ
			|	SUI_docs.id_doc = &id_doc
			|	И SUI_docs.НастройкаДокумента = &НастройкаДокумента";
		
		Запрос.УстановитьПараметр("id_doc", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументСсылка));
		Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат.ЕстьПотокШК = Выборка.ЕстьПотокШК;
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьSIDДокументаОбменаПоСсылкеДокумента(ДокументСсылка, НастройкаДокумента = Неопределено) Экспорт
	Возврат SUI_ДокументыОбмена.ПолучитьSIDДокументовОбмена(ДокументСсылка, НастройкаДокумента);
КонецФункции

Функция ЭтоДокументГрупповогоПересчета(ДокументСсылка)Экспорт
	
	Возврат SUI_ДокументыОбмена.ЭтоДокументГрупповогоПересчета(ДокументСсылка);
		
КонецФункции 

Функция ДокументНуждаетсяВОбработке(ДокументСсылка)Экспорт
	
	Возврат SUI_ДокументыОбмена.ДокументНуждаетсяВОбработке(ДокументСсылка);
		
КонецФункции 
           
Функция ЗавершитьГрупповойПересчетДокумента(Знач Документ, ИнтерактивноеЗавершение = Истина) Экспорт
	
	Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Документ) Тогда
		
		Документ = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Документ);
		
		Если Документ = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РегистрыСведений.SUI_docs_tbl_goods_delta.ЗагрузитьИтогиПересчетаВТоварыДокументаОбмена(Документ);
		
КонецФункции

Функция ДокументБылВыгружен(Документ, ИсключаемыеСостояния = Неопределено, НастройкаДокумента = Неопределено) Экспорт
	Возврат SUI_ДокументыОбмена.ДокументБылВыгружен(Документ, ИсключаемыеСостояния, НастройкаДокумента);
КонецФункции

Функция ПолучитьШтрихкодыМаркировкиДокументаОбмена(ДокументСсылка, НастройкаДокумента = Неопределено, ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДокументСсылка", ДокументСсылка);
	ПараметрыПроцедуры.Вставить("НастройкаДокумента", НастройкаДокумента);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"SUI_ДокументыОбмена.ПолучитьШтрихкодыМаркировкиДокументаОбмена", 
		ПараметрыПроцедуры, 
		ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы));
	
КонецФункции

#КонецОбласти
